Tekla Open API Reference for Tekla Structures 2025
WeldGeometry Properties
The WeldGeometry type exposes the following members.
Properties
Name | Description
Polygons
 Gets the weld seam specific ArrayList of Polygon objects.
Position
 Gets the weld seam position (above or below).
Top
See Also
Reference
WeldGeometry Class
Tekla.Structures.Model.Welding Namespace